<template>
  <div style="margin: 10vh 30vw 0 30vw; width: 40vw">
    <span>Terms of Use/Service（利用規約)</span>
    <pre>
# アプリケーションの内容

* 各種TRPGをオンラインで行う際のユーティリティ・ツール。
* Googleのアカウントを利用してログインする。
* tsrm(tsrmix@gmail.com)が代表で開発、管理保守を行う。

# 遵守事項

このサービス(以下、hiace)を利用するにあたり、ユーザは以下の項目を理解し、同意し、遵守する。

* hiaceは事前の予告なく運営停止、或いは終了する場合がある。
* hiaceに保存したあらゆる電子情報は、管理者の意図に依らずアクセス不可となる、或いは削除される場合がある。
* バージョンアップやバグ修正作業を行うにあたり、その前後での既存データの整合性を考慮しない。
* hiaceはユーザからのバグ報告や改修要望を収集するが、その修正または実装についての責任を負わない。
* hiaceはユーザ間のトラブルの解決のための情報提供を行う義務を負わない。
* 公的機関の協力要請により、hiaceに保存した電子情報を同機関に提出する場合がある。
* 著作権保有者からの要請により、hiaceに保存した電子情報を根拠に、法的機関への通報に協力する場合がある。
* 管理者は特定のGoogleアカウントに対して、サービスを利用不可能にする場合がある。

サービス管理者およびhiaceにログイン可能な第三者のユーザは、
特定のルームへの参加状態に依らず、以下の情報を閲覧可能である。

* あなたのメールアドレス
* あなたが入力したチャットなどのすべての文字列
* アップロードした画像などのファイル

# 禁止事項

以下の項目に該当するログを発見した場合、
管理者はそのGoogleアカウントでのサービス利用を不可能にする。
また、然るべき機関に通報する必要があると判断した場合はそれを行い、関連する情報を提出する。

* あらゆる犯罪、法律違反、条例違反のための利用
* 著作権を無視したファイル配布のための利用
* 犯罪者同士の連絡のための利用

# 免責事項

hiaceの管理者は、以下の項目に対する責任・義務を負わない。

* hiaceのユーザ間で発生したトラブルについての調停。
* hiaceの利用によってあなたに生じうる、精神的・物質的な資産に対しての損害。


2021/02/05
"hiace"
tsrm (tsrmix@gmail.com)
  </pre
    >
  </div>
</template>

<script>
export default {
  name: "TermsOfService",
};
</script>

<style scoped></style>
